In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.24.2'

# **1. ix has been deprecated**

In [18]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry', index_col = 'country')
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [24]:
drinks.loc['Angola', 'spirit_servings']

57

In [25]:
drinks.iloc[4,1]

57

In [28]:
drinks.loc['Angola', drinks.columns[1]]

57

In [29]:
drinks.iloc[4, drinks.columns.get_loc('spirit_servings')]

57

# **2. Aliases have been added for isnull and notnull**

In [31]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [35]:
#check which values are missing
ufo.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [37]:
#check which values are not missing
ufo.notnull().head()

   City  Colors Reported  Shape Reported  State  Time
0  True            False            True   True  True
1  True            False            True   True  True
2  True            False            True   True  True
3  True            False            True   True  True
4  True            False            True   True  True

In [38]:
#drop rows with missing values
ufo.dropna().head()

          City Colors Reported Shape Reported State             Time
12      Belton             RED         SPHERE    SC  6/30/1939 20:00
19  Bering Sea             RED          OTHER    AK  4/30/1943 23:00
36  Portsmouth             RED      FORMATION    VA   7/10/1945 1:30
44   Blairsden           GREEN         SPHERE    CA  6/30/1946 19:00
82    San Jose            BLUE        CHEVRON    CA  7/15/1947 21:00

In [39]:
#fill in missing values
ufo.fillna(value='UNKNOW').head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca          UNKNOW       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          UNKNOW          OTHER    NJ  6/30/1930 20:00
2               Holyoke          UNKNOW           OVAL    CO  2/15/1931 14:00
3               Abilene          UNKNOW           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          UNKNOW          LIGHT    NY  4/18/1933 19:00

In [40]:
#new_alias for isnull
ufo.isna().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [41]:
#new_alias for notnull
ufo.notna().head()

   City  Colors Reported  Shape Reported  State  Time
0  True            False            True   True  True
1  True            False            True   True  True
2  True            False            True   True  True
3  True            False            True   True  True
4  True            False            True   True  True

# **3. drop now accepts "index" and "columns" keywords**

In [42]:
# drop now accept 'index' nand 'columns' keywords
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [43]:
#old way to drop rows: specify labelas and axis
ufo.drop([0,1], axis=0).head()
ufo.drop([0,1], axis='index').head()

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

In [44]:
#new way to drop rows:specify index
ufo.drop(index=[0,1]).head()

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

In [45]:
#old way to drop columns:specify labels and axis
ufo.drop(['City','State'], axis=1).head()
ufo.drop(['City','State'], axis='columns').head()

  Colors Reported Shape Reported             Time
0             NaN       TRIANGLE   6/1/1930 22:00
1             NaN          OTHER  6/30/1930 20:00
2             NaN           OVAL  2/15/1931 14:00
3             NaN           DISK   6/1/1931 13:00
4             NaN          LIGHT  4/18/1933 19:00

In [46]:
ufo.drop(columns=['City', 'State']).head()

  Colors Reported Shape Reported             Time
0             NaN       TRIANGLE   6/1/1930 22:00
1             NaN          OTHER  6/30/1930 20:00
2             NaN           OVAL  2/15/1931 14:00
3             NaN           DISK   6/1/1931 13:00
4             NaN          LIGHT  4/18/1933 19:00

# **4. rename and reindex now accept axis keyword**

In [49]:
#old way to rename columns: specify columns
ufo.rename(columns={'City':'CITY', 'State':'STATE'}).head()

                   CITY Colors Reported Shape Reported STATE             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [52]:
#new way to rename columns: specify mapper and axis
ufo.rename({'City':'CITY', 'State':'STATE'}, axis='columns').head()

                   CITY Colors Reported Shape Reported STATE             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [53]:
#mapper can be a function
ufo.rename(str.upper, axis='columns').head()

                   CITY COLORS REPORTED SHAPE REPORTED STATE             TIME
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

# **5.Ordered categories must be specified independent of the data**

In [63]:
#create a small df
df = pd.DataFrame({'ID':[100, 101, 102, 103], 
                   'quality': ['good', 'very good', 'good', 'excellent']})
df

    ID    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [56]:
df.quality.astype('category', categories=['good', 'vary good', 'excellent'], ordered=True)

F:\Program Files\Anaconda\lib\site-packages\IPython\core\interactiveshell.py:3296: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  exec(code_obj, self.user_global_ns, self.user_ns)

0         good
1          NaN
2         good
3    excellent
Name: quality, dtype: category
Categories (3, object): [good < vary good < excellent]

In [66]:
#new way tocreate an ordered category
from pandas.api.types import CategoricalDtype

quality_cat = CategoricalDtype(['good', 'very good', 'excellent'], ordered=True)
df['quality'] = df.quality.astype(quality_cat)
df.quality

0         good
1    very good
2         good
3    excellent
Name: quality, dtype: category
Categories (3, object): [good < very good < excellent]

In [67]:
df.head()

    ID    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [68]:
df['quality']

0         good
1    very good
2         good
3    excellent
Name: quality, dtype: category
Categories (3, object): [good < very good < excellent]